source/about/justin-gordon-resume.html
---
layout: page
title: "Justin Gordon Resume"
date: 2013-05-06 22:04
comments: true
sharing: true
footer: true
canonical: https://www.shakacode.com/blog/justin-gordon-resume/
---
<p>
Contact: at gmail, <code>justin.gordon</code>, 141 Makahiki Street, Paia, HI 96779, (808)
281-7272 (M), <a href="https://www.linkedin.com/in/railsonmaui">Linked In</a>.
</p>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">Overview</h2>
<div class="outline-text-2" id="text-orgheadline1">
<ul class="org-ul">
<li>Currently Rails consulting.</li>
<li>From the backend persistence layer to the Ruby layer, to client side
JavaScript, I've got projects covered. I'm typically adding code to Github
and submitting a pull request within a day of joining a project.</li>
<li>Ruby on Rails full stack engineer, ruby, coffeescript, jQuery, saas, haml.</li>
<li>Extensive contributions to high performance Java enterprise applications used
by the world's largest retailers.</li>
<li>Areas of expertise include: Ruby on Rails, Test Driven Development (<a href="http://rspec.info/">rspec</a> and
<a href="http://junit.org/">JUnit</a>), profiling and optimizing (with <a href="http://www.yourkit.com/">Yourkit</a>), concurrency, caching, EmberJs.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">Education</h2>
<div class="outline-text-2" id="text-orgheadline2">
<ul class="org-ul">
<li><b>University of California at Berkeley</b>, Walter Haas School of Business MBA, December 2001, Beta Gamma Sigma, Management of Technology Certificate</li>
<li><b>Harvard University</b>, BA Applied Mathematics, Magna Cum Laude, 1991</li>
<li><b>Chartered Financial Analyst</b>, 1996</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7">Experience</h2>
<div class="outline-text-2" id="text-orgheadline7">
</div><div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3">Rails Consulting Projects</h3>
<div class="outline-text-3" id="text-orgheadline3">
<ul class="org-ul">
<li>Rails projects with significant contributions: <a href="http://www.housinglist.com/">http://www.housinglist.com/</a> and
<a href="http://www.blinkinc.com/">http://www.blinkinc.com/</a>.</li>
<li>Please email me at <code>justin.gordon</code> at <code>gmail.com</code> or if you're interested in
learning how I might be able to help your business.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4">IBM (Trigo Acquisition), <a href="http://www-01.ibm.com/software/data/infosphere/mdm/collaborative.html">InfoSphere MDM Collaborative Edition</a></h3>
<div class="outline-text-3" id="text-orgheadline4">
<ul class="org-ul">
<li><a href="http://www.railsonmaui.com/about/about-justin-gordon-programming.html#sec-3">Narrative of Details</a></li>
<li>November, 2002 to 2013. Team Lead, Senior Engineer, Architect, in
Burlingame, CA and telecommuting from Maui since 2007.</li>
<li>The world's largest retailers, including Walmart and Lowes, use the algorithms
designed, implemented, and optimized by Justin to store and edit all their vendor
product data <b>currently</b>.</li>
<li>Java software engineering leadership on 3 tier web-based enterprise
application for product information management, collection and distribution,
for the world’s largest retailers.</li>
<li>Broad contributions to all aspects of the leading (<a href="http://public.dhe.ibm.com/common/ssi/ecm/en/iml14344usen/IML14344USEN.PDF">according to Gartner</a>)
product for Master Data Management of Product Information, used by many of
the world's largest retailers.</li>
<li>Most significant contribution is the lead implementer of improved storage
layer architecture from shredded database tables to highly performing
binary serialization, using an XP development methodology (TDD, pair programming,
and scrum meetings), along with a mechanism of searching the data via database
XML.</li>
<li>Responsible for the majority of server side performance optimizations, such as
the use of EhCache distributed caching. Led integration of profilers into PIM
product for more efficient customer support.</li>
<li>Responsible for all development aspects of releases from 4.2.1, 5.0.1 (Home
Depot/Albertsons “Large Retailer” release), 6.x, and 9.x, from negotiation of
product feature set and schedule, to developer assignments, to handling
resource re-allocations, to development procedures, to bug triage, and final
release.</li>
<li>Process and innovation driver: Instigated move toward Agile Development
Methodologies, including Pair Programming and Test Driven Development (TDD).</li>
<li>Main contact for tough customer issues, especially regarding performance (cpu
and memory usage), data integrity, caching, and threading issues.</li>
<li>Developed methodology to bring TDD product wide using the Dependent Object
Framework.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5">Extensity</h3>
<div class="outline-text-3" id="text-orgheadline5">
<ul class="org-ul">
<li>1999-2001, Emeryville, CA, Architect, Tools</li>
<li>Responsible for all of Extensity’s development efforts (all Java) aimed at
system administrators and integrators, including serving as the co-architect
of cross-functional efforts to improve the efficiency of Extensity’s
professional services. Conducted architecture and code reviews, gathered
customer requirements, created design documents, conducted training sessions,
and supervised team members. Awarded "Employee of the Month" for October 2000.
Promoted from “Team Lead” to “Architect” in June 2000.</li>
<li>Led re-architecture of 5.0 System Administration Tool, from marketing
requirements and initial design plans to coding and refinement to GA in
June 2000.</li>
<li>Primary designer and implementer of “Group Based Data” (Application security)</li>
<li>Architect of the GuiEditor, an internal tool for designing screens and other
installation customizations. Designed and coded tools for configuration of
sample and meta data.</li>
<li>Led the design for multinational organizations with features such as support for VAT.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6">Other Experience</h3>
<div class="outline-text-3" id="text-orgheadline6">
<p>
In the 1990's, I did C++/Sybase investment programming at <a href="http://www.mcm.com/">Mellon Capital</a> and
Java programming for a startup Infoscape. Here's some details from an <a href="justin-gordon-resume-1990s.html">older
resume</a> if you're interested.
</p>
</div>
</div>
</div>


<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8">Patents</h2>
<div class="outline-text-2" id="text-orgheadline8">
<ul class="org-ul">
<li><a href="http://appft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&amp;Sect2=HITOFF&amp;d=PG01&amp;p=1&amp;u=/netahtml/PTO/srchnum.html&amp;r=1&amp;f=G&amp;l=50&amp;s1=%2220070244865%22.PGNR.">Method and system for data retrieval using a product information search engine</a></li>
<li><a href="http://appft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&amp;Sect2=HITOFF&amp;d=PG01&amp;p=1&amp;u=/netahtml/PTO/srchnum.html&amp;r=1&amp;f=G&amp;l=50&amp;s1=%2220090210434%22.PGNR.">STORAGE AND RETRIEVAL OF VARIABLE DATA</a></li>
<li><a href="http://appft1.uspto.gov/netacgi/nph-Parser?Sect1=PTO1&amp;Sect2=HITOFF&amp;d=PG01&amp;p=1&amp;u=/netahtml/PTO/srchnum.html&amp;r=1&amp;f=G&amp;l=50&amp;s1=%2220090178029%22.PGNR.">Dependent Object Framework for JUnit Testing</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9">Publications</h2>
<div class="outline-text-2" id="text-orgheadline9">
<ul class="org-ul">
<li>My talks at Dr. Dobbs were the basis for the chapter on Test Driven
Development in <a href="http://www.distributedscrum.com/?page_id=11">A Practical Guide to Distributed Scrum</a>.</li>
</ul>
</div>
</div>
